Revit 2027 API
RailingType.SecondaryHandrailLateralOffset Property
 The lateral offset of the secondary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SecondaryHandrailLateralOffset { get; }
Public ReadOnly Property SecondaryHandrailLateralOffset As Double
	Get
public:
property double SecondaryHandrailLateralOffset {
	double get ();
}
member SecondaryHandrailLateralOffset : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  The rail has no secondary hand rail.
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace